       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. test1.
AUTHOR. Mike Binns.
DATE-WRITTEN.March 19th 2021
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NAME PIC X(4).
PROCEDURE DIVISION.
MOVE "Mike" TO NAME
DISPLAY "Hello " NAME
ACCEPT NAME
DISPLAY "Hello " NAME
STOP RUN.

